app/controllers/books_controller.rb

INSERT INTO "books" ("user_id", "name", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 225], ["name", "asdf"], ["author", "asdf"], ["created_at", "2022-08-30 10:33:02.446351"], ["updated_at", "2022-08-30 10:33:02.446351"]]
---
  def create
    @book = current_user.books.build(book_params)

    if @book.save

UPDATE "books" SET "name" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["name", "Guerra y paz"], ["updated_at", "2022-08-30 10:44:07.953279"], ["id", 163]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)